########################################################################
# Taps                                                                 #
########################################################################
tap "hashicorp/tap"

########################################################################
# CLI                                                                  #
########################################################################
brew "ansible"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "cmake"
cask "codex"
cask "opencode"
brew "coreutils"
brew "curl", link: true
brew "docker-completion"
brew "ffmpeg"
brew "findutils"
brew "gcc"
brew "gdb"
brew "gh"
brew "git"
brew "gradle"
brew "gradle-completion"
brew "grpc"
brew "htop"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "maven"
brew "maven-completion"
brew "moreutils"
brew "neovim"
brew "nmap"
brew "openssl@3"
brew "pip-completion"
brew "protobuf"
brew "readline"
brew "ripgrep"
brew "shellcheck"
brew "spring-completion"
brew "sqlite"
brew "terraform"
brew "tmux"
brew "tree"
brew "vault"
brew "wget"
brew "wireshark"
brew "zsh"

# Modern CLI replacements (same as linux-setup apt packages)
brew "bat"       # better cat with syntax highlighting
brew "eza"       # better ls (replaces exa)
brew "fd"        # better find
brew "fzf"       # fuzzy finder (used by shell keybindings)
brew "mise"      # runtime version manager (node, python, go, …)
brew "sd"        # better sed
brew "yq"        # YAML processor

# Coding agent productivity
brew "just"    # task runner — agents call `just <task>` without parsing Makefiles
brew "direnv"  # per-directory env vars — agents cd in and env is automatically set
brew "shfmt"   # shell script formatter — agents write shell; this keeps it correct
brew "uv"      # Python package manager — de facto standard, replaces pip/venv/pyenv

########################################################################
# Apps                                                                 #
########################################################################
cask "antigravity"
cask "alacritty"
cask "wezterm"                     # primary terminal emulator
cask "alfred"
cask "docker"
cask "docker-desktop"
cask "firefox"
cask "google-chrome"
cask "github"
cask "jetbrains-toolbox"
cask "font-monaspace"
cask "font-jetbrains-mono-nerd-font"  # required by WezTerm + neovim UI icons
cask "maccy"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "visualvm"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zoom"
