########################################################################
# CLI essentials                                                       #
########################################################################
brew "cmake"             # native build tool — needed for many native extensions
brew "coreutils"         # GNU coreutils (gls, gcat, …) — consistent behaviour vs BSD
brew "curl", link: true  # ensure modern curl overrides system version
brew "findutils"         # GNU find — more powerful than BSD find
brew "gh"
brew "git"
brew "htop"
brew "imagemagick"
brew "jq"
brew "moreutils"         # sponge, vipe, ts, etc.
brew "nmap"              # network debugging and port scanning
brew "openssl@3"
brew "ripgrep"
brew "shellcheck"
brew "sqlite"
brew "tmux"
brew "zsh"

########################################################################
# Modern CLI tools (battle-tested, high daily value)                  #
########################################################################
brew "bat"     # cat with syntax highlighting and git diff integration
brew "eza"     # ls replacement — tree view, git status, icons
brew "fd"      # find replacement — faster, simpler syntax
brew "fzf"     # fuzzy finder — shell history, file search, ctrl-r
brew "yq"      # YAML/JSON/TOML processor — used in CI and dotfile automation

########################################################################
# Runtime and package management                                       #
########################################################################
brew "mise"    # single tool for node/python/go/java version management
brew "uv"      # Python package manager — replaces pip/venv/pyenv

########################################################################
# Agentic engineering productivity                                     #
########################################################################
brew "direnv"  # per-directory env vars — agents cd in and env is set automatically
brew "just"    # task runner — cleaner than Makefiles, agents call `just <task>`
brew "shfmt"   # shell formatter — agents write shell; keeps it well-formatted

########################################################################
# Apps                                                                 #
########################################################################
cask "alfred"
cask "antigravity"               # GPU switching in menu bar
cask "codex"
cask "docker-desktop"            # includes docker CLI and compose
cask "firefox"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "font-jetbrains-mono-nerd-font"  # required by WezTerm + neovim UI icons
cask "maccy"                     # clipboard manager
cask "nordvpn"
cask "notion"
cask "opencode"
cask "rectangle"                 # window management
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "vlc"
cask "wezterm"                   # primary terminal emulator
cask "whatsapp"
cask "zed"
cask "zoom"
